app/controllers/tasks_controller.rb

  def index
    @tasks = Task.all.reverse
---
SELECT "tasks".* FROM "tasks"

  def create
    @task = Task.new(task_params)

    respond_to do |format|
      if @task.save
---
INSERT INTO "tasks" ("name", "status", "created_at", "updated_at") VALUES (?, ?, ?, ?) RETURNING "id"  [["name", "learn rails "], ["status", 1], ["created_at", "2024-12-10 11:01:26.800845"], ["updated_at", "2024-12-10 11:01:26.800845"]]

  def update
    respond_to do |format|
      if @task.update(task_params)
---
UPDATE "tasks" SET "name" = ?, "updated_at" = ? WHERE "tasks"."id" = ?  [["name", "your great223"], ["updated_at", "2024-12-11 06:59:15.019731"], ["id", 6]]

  def destroy
    @task.destroy!
---
DELETE FROM "tasks" WHERE "tasks"."id" = ?  [["id", 6]]